## Terraform Summary

| Step                         | Result  |
|:-----------------------------|:-------:|
| 🖌  Terraform Format & Style | ✅ |
| ⚙️  Terraform Initialization  | ✅ |
| 🤖  Terraform Validation     | ✅ |
| 📖  Terraform Plan           | ✅ |

_**Hint:** If "Terraform Format & Style" failed, run `terraform fmt -recursive` from the `terraform/` directory and commit the results._

### Output

<details>
<summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>

<details>
<summary>Plan Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
  ~ update in-place
-   destroy
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_ecs_service.console will be updated in-place
  ~ resource "aws_ecs_service" "console" {
        id                                 = "arn:aws:ecs:us-west-2:357150818708:service/cpfreporter/cpfreporter-console"
        name                               = "cpfreporter-console"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console:67" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.console must be replaced
+/- resource "aws_ecs_task_definition" "console" {
      ~ arn                      = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console:67" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ image                  = "ghcr.io/usdigitalresponse/cpf-reporter-console@sha256:7a9937a2916344ae4c86052181cd8c30bd8d704f2c5c0d39d0a08bdd188381de" -> "ghcr.io/usdigitalresponse/cpf-reporter-console@sha256:af4d0856057167ff94ef2b10910900a2fc999a99f155f6d9c0e281231c20ac52"
-                   mountPoints            = []
                    name                   = "console"
-                   portMappings           = []
-                   systemControls         = []
-                   volumesFrom            = []
                    # (7 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "cpfreporter-console" -> (known after apply)
      ~ revision                 = 67 -> (known after apply)
-       tags                     = {} -> null
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_s3_object.lambda_artifact-cpfValidation will be updated in-place
  ~ resource "aws_s3_object" "lambda_artifact-cpfValidation" {
      ~ etag                   = "790ffef857eea6863b2c57ba79ee7589-5" -> "2032d24a1faa622f8d6365689cbbcf21"
        id                     = "cpfValidation.2032d24a1faa622f8d6365689cbbcf21.zip"
        tags                   = {}
      ~ version_id             = "4k2DX5etBYxoUL5Hc7tFrmcj.XBgCFfv" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.lambda_artifact-excelToJson will be updated in-place
  ~ resource "aws_s3_object" "lambda_artifact-excelToJson" {
      ~ etag                   = "be8931411b1c45bd9867987446f38b7b-6" -> "c14f94724ff345d2473505225992af61"
        id                     = "excelToJson.c14f94724ff345d2473505225992af61.zip"
        tags                   = {}
      ~ version_id             = "LDytrxGz3Ef27s04wpVFxc3CWfj.Rgit" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.lambda_artifact-graphql must be replaced
+/- resource "aws_s3_object" "lambda_artifact-graphql" {
+       acl                    = (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "22cd37320353d8b104d20a87cd3572cb-6" -> "2a2975255328d004632c2d2619ecb34a"
      ~ id                     = "graphql.640021f2c6b16b805db14cd0217749a4.zip" -> (known after apply)
      ~ key                    = "graphql.640021f2c6b16b805db14cd0217749a4.zip" -> "graphql.2a2975255328d004632c2d2619ecb34a.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source_hash            = "640021f2c6b16b805db14cd0217749a4" -> "2a2975255328d004632c2d2619ecb34a"
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "OiwZ0xn0VZd_uLSS1c_JJHz7KnAU59MR" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["200.html"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "49013c8c0c61b8d102abdc3d57156f57" -> "b67979f6969eddc3678e4f2402c1858f"
        id                     = "dist/200.html"
      ~ source_hash            = "49013c8c0c61b8d102abdc3d57156f57" -> "b67979f6969eddc3678e4f2402c1858f"
        tags                   = {}
      ~ version_id             = ".BSJIfdn70CpWOm6FZ7d2IbUztmGQvjn" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["build-manifest.json"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "1966e4fc67f45eb28bbdb2d84c5bd175" -> "71895d356089997caa8ed1d4dd90ddff"
        id                     = "dist/build-manifest.json"
      ~ source_hash            = "1966e4fc67f45eb28bbdb2d84c5bd175" -> "71895d356089997caa8ed1d4dd90ddff"
        tags                   = {}
      ~ version_id             = "pmZhMz9108Y2u6ICnHtleQYiY36g2Sb0" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["chunk-references.json"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "1eb52694c1e69cf35134dec2981f00fd" -> "96db4738ee89bb80d81a618652242b84"
        id                     = "dist/chunk-references.json"
      ~ source_hash            = "1eb52694c1e69cf35134dec2981f00fd" -> "96db4738ee89bb80d81a618652242b84"
        tags                   = {}
      ~ version_id             = "WiQA8pOoSPNHRc2mdSKOTFnLTN7.aRKG" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["index.html"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "49013c8c0c61b8d102abdc3d57156f57" -> "b67979f6969eddc3678e4f2402c1858f"
        id                     = "dist/index.html"
      ~ source_hash            = "49013c8c0c61b8d102abdc3d57156f57" -> "b67979f6969eddc3678e4f2402c1858f"
        tags                   = {}
      ~ version_id             = "GbagdSfoqsjNn87dXSUdBeaesPM4Fe2n" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.152d361b.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "f7e0415554331c2d3bb99ad3c2c25e4c"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/app.152d361b.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.152d361b.js"
+       source_hash            = "f7e0415554331c2d3bb99ad3c2c25e4c"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.152d361b.js.LICENSE.txt"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/plain"
+       etag                   = "b703266ba347d460c07ac79899e011fa"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/app.152d361b.js.LICENSE.txt"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.152d361b.js.LICENSE.txt"
+       source_hash            = "b703266ba347d460c07ac79899e011fa"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.9e039355.js"] will be destroyed
  # (because key ["static/js/app.9e039355.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "25d48ee40229f0b26f8bb53fce712ce8" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/app.9e039355.js" -> null
-       key                    = "dist/static/js/app.9e039355.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.9e039355.js" -> null
-       source_hash            = "25d48ee40229f0b26f8bb53fce712ce8" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "3dyyQr1MuzxmG.ELemNlCIKBiVMvwNpF" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.9e039355.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/app.9e039355.js.LICENSE.txt"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/plain" -> null
-       etag                   = "b703266ba347d460c07ac79899e011fa" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/app.9e039355.js.LICENSE.txt" -> null
-       key                    = "dist/static/js/app.9e039355.js.LICENSE.txt" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.9e039355.js.LICENSE.txt" -> null
-       source_hash            = "b703266ba347d460c07ac79899e011fa" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "m5RR0yOWL4yZsg78M.DP47mr94XnkZup" -> null
    }

  # module.lambda_function-cpfValidation.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-cpfValidation"
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-cpfValidation:36" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-cpfValidation:36/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "36" -> (known after apply)
        # (21 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                = "897f2d88df0c8126983aa382f3e9a438690f9534" -> "b04daa6a00e89b0d71d92c601bad7936a4518f76"
              ~ "DD_TAGS"                      = "git.commit.sha:897f2d88df0c8126983aa382f3e9a438690f9534,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:b04daa6a00e89b0d71d92c601bad7936a4518f76,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                   = "897f2d88df0c8126983aa382f3e9a438690f9534" -> "b04daa6a00e89b0d71d92c601bad7936a4518f76"
                # (13 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.lambda_function-cpfValidation.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "36" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_function-excelToJson.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-excelToJson"
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-excelToJson:36" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-excelToJson:36/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "36" -> (known after apply)
        # (21 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                = "897f2d88df0c8126983aa382f3e9a438690f9534" -> "b04daa6a00e89b0d71d92c601bad7936a4518f76"
              ~ "DD_TAGS"                      = "git.commit.sha:897f2d88df0c8126983aa382f3e9a438690f9534,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:b04daa6a00e89b0d71d92c601bad7936a4518f76,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                   = "897f2d88df0c8126983aa382f3e9a438690f9534" -> "b04daa6a00e89b0d71d92c601bad7936a4518f76"
                # (13 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.lambda_function-excelToJson.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "36" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_function-graphql.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-graphql"
      ~ last_modified                  = "2024-04-01T19:03:17.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-graphql:83" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-graphql:83/invocations" -> (known after apply)
      ~ s3_key                         = "graphql.640021f2c6b16b805db14cd0217749a4.zip" -> "graphql.2a2975255328d004632c2d2619ecb34a.zip"
        tags                           = {}
      ~ version                        = "83" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                      = "897f2d88df0c8126983aa382f3e9a438690f9534" -> "b04daa6a00e89b0d71d92c601bad7936a4518f76"
              ~ "DD_TAGS"                            = "git.commit.sha:897f2d88df0c8126983aa382f3e9a438690f9534,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:b04daa6a00e89b0d71d92c601bad7936a4518f76,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                         = "897f2d88df0c8126983aa382f3e9a438690f9534" -> "b04daa6a00e89b0d71d92c601bad7936a4518f76"
                # (17 unchanged elements hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

  # module.lambda_function-graphql.aws_lambda_permission.current_version_triggers["APIGateway"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "APIGateway" -> (known after apply)
      ~ qualifier           = "83" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

Plan: 7 to add, 10 to change, 7 to destroy.
```

</details>

*Pusher: @as1729, Action: `pull_request_target`, Workflow: [`Continuous Integration`](https://github.com/usdigitalresponse/cpf-reporter/actions/runs/8514289738)*